ListOfWords = ['конь',
               'единорог',
               'Указатель',

               'радуга',

               'мармелад',

               'поиск',

               'прятки',

               'сторож',

               'копейка',

               'леопард',

               'аттракцион',

               'дрессировка',

               'ошейник',

               'карамель',

               'водолаз',

               'защита',

               'батарея',

               'решётка',

               'квартира',

               'дельфинарий',

               'непогода',

               'вход',

               'полиция',

               'перекрёсток',

               'башня',

               'стрелка',

               'градусник',

               'бутылка',

               'щипцы',

               'наволочка',

               'павлин',

               'карточка',

               'записка',

               'лестница',

               'переулок',

               'сенокос',

               'рассол',

               'закат',

               'сигнализация',

               'журнал',

               'заставка',

               'тиранозавр',

               'микрофон',

               'прохожий',

               'квитанция',

               'пауза',

               'новости',

               'скарабей',

               'серебро',

               'творог',

               'осадок',

               'песня',

               'корзина',

               'сдача',

               'овчарка',

               'хлопья',

               'телескоп',

               'микроб',

               'угощение',

               'экскаватор',

               'письмо',

               'пришелец',

               'айсберг',

               'пластик',

               'доставка',

               'полка',

               'билет',

               'вторник',

               'льдина',

               'интерес',

               'троллейбус',

               'футболист',

               'лисёнок',
               'пример',

               'баклажан',

               'лягушка',

               'джокер',

               'котлета',

               'накидка',

               'дикобраз',

               'барбарис',

               'работник',

               'кристалл',

               'доспехи',

               'халва',

               'велосипед',

               'крючок',

               'кочка',

               'черепаха',

               'петля',

               'осень',

               'яйцо',
               ]
alphabet = ["а","б","в","г","д","е","ё","ж","з","и","й","к","л","м","н","о",
            "п","р","с","т","у","ф","х","ц","ч","ш","щ","ъ","ы","ь","э","ю","я"]
